int i1 = 0;
double d2 = 1.43;
float f3 = 4.4f;
byte b4 = 4;
Boolean b5 = true;
string s6 = "Hello mazafaka!";
char c7 = '!';
long l8 = 428432476;
short s9 = -100;
ushort u10 = 65000;
Console.WriteLine($"{i1}, {d2}, {f3}, {b4}, {b5}, {s6}, {c7}, {l8}, {s9}, {u10}. Вот и они:)  ");
/*
Задача:
Попрактикуйтесь в создании переменных, объявить 10 переменных разных типов.
Напоминание: переменные именуются с маленькой буквы, если название состоит из нескольких слов, то комбинируем их следующим образом - названиеПеременной.
Также имя всегда должно отражать суть того, что хранит переменная.
*/
    
